package com.solution.lushkov;

import org.apache.log4j.LogManager;
import org.apache.log4j.Logger;

public class Main {
    public static final Logger LOG = LogManager
            .getLogger(Main.class.getName());

    /**
     * Main class. Start point of program.
     *
     * @param args - arguments
     */
    public static  void main(String[] args) {
        /**
         * Вы создаете файл с данными вручную
         * (в процессе устного ответа я могу поменять данные (все данные на английском языке),
         * программа не меняется в процессе устного ответа).
         *
         * Считать данные из файла технологией IO.
         *
         * Обработать  данные, выделив нужные для задачи части
         * (например, в строке встречается день недели, год и месяц,
         * дата в разных комбинациях в строке «Я любил 1999 год, а особенно февраль, который состоял из 29 дней»).
         *
         * Вычислить количество дней в месяце в указанном году и проверить правильность из строки (Java 7-).
         *
         * Вычислить количество дней в месяце в указанном году и проверить правильность из строки (Java 8+).
         *
         * Записать данные в файл технологией NIO.
         *
         * Подготовить программу для JavaDoc.
         *
         * Покрыть проект тестами.
         */
    }
}
